In [1]:
import pandas as pd
import numpy as np
salary=pd.read_csv('salary_data_cleaned.csv')

In [2]:
salary.head(2)

,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,...,avg_salary,company_txt,job_state,same_state,age,python_yn,R_yn,spark,aws,excel
0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 to 1000 employees,1973,Company - Private,...,72.0,Tecolote Research\n,NM,0,47,1,0,0,0,1
1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+ employees,1984,Other Organization,...,87.5,University of Maryland Medical System\n,MD,0,36,1,0,0,0,0

In [3]:
salary.columns

Index(['Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'hourly', 'employer_provided', 'min_salary', 'max_salary', 'avg_salary',
       'company_txt', 'job_state', 'same_state', 'age', 'python_yn', 'R_yn',
       'spark', 'aws', 'excel'],
      dtype='object')

In [4]:
df=salary.drop(['Job Title','Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'hourly', 'employer_provided', 'min_salary', 'max_salary','company_txt'],axis='columns')
df.head()

   avg_salary job_state  same_state  age  python_yn  R_yn  spark  aws  excel
0        72.0        NM           0   47          1     0      0    0      1
1        87.5        MD           0   36          1     0      0    0      0
2        85.0        FL           1   10          1     0      1    0      1
3        76.5        WA           1   55          1     0      0    0      0
4       114.5        NY           1   22          1     0      0    0      1

In [5]:
df.job_state.unique()

array([' NM', ' MD', ' FL', ' WA', ' NY', ' TX', ' CA', ' VA', ' MA',
       ' NJ', ' CO', ' IL', ' KY', ' OR', ' CT', ' MI', ' DC', ' OH',
       ' AL', ' MO', ' PA', ' GA', ' IN', ' LA', ' WI', ' NC', ' AZ',
       ' NE', ' MN', ' Los Angeles', ' UT', ' TN', ' DE', ' ID', ' RI',
       ' IA', ' SC', ' KS'], dtype=object)

In [6]:
df.groupby('job_state')['job_state'].agg('count')

job_state
AL               8
AZ               9
CA             151
CO              11
CT               5
DC              11
DE               6
FL              16
GA               6
IA               5
ID               2
IL              40
IN              10
KS               3
KY               6
LA               4
Los Angeles      1
MA             103
MD              35
MI               6
MN               2
MO               9
NC              21
NE               4
NJ              17
NM               3
NY              72
OH              14
OR               4
PA              33
RI               1
SC               1
TN              13
TX              28
UT              10
VA              41
WA              21
WI              10
Name: job_state, dtype: int64

In [7]:
df['job_state']=df['job_state'].replace(' Los Angeles',' CA')
df.groupby('job_state')['job_state'].agg('count')

job_state
AL      8
AZ      9
CA    152
CO     11
CT      5
DC     11
DE      6
FL     16
GA      6
IA      5
ID      2
IL     40
IN     10
KS      3
KY      6
LA      4
MA    103
MD     35
MI      6
MN      2
MO      9
NC     21
NE      4
NJ     17
NM      3
NY     72
OH     14
OR      4
PA     33
RI      1
SC      1
TN     13
TX     28
UT     10
VA     41
WA     21
WI     10
Name: job_state, dtype: int64

In [8]:
dummies=pd.get_dummies(df.job_state)

In [9]:
merge=pd.concat([df,dummies.drop(' WI',axis='columns')],axis='columns')

In [10]:
final=merge.drop(['job_state'],axis='columns')
final.head()

,avg_salary,same_state,age,python_yn,R_yn,spark,aws,excel,AL,AZ,...,OH,OR,PA,RI,SC,TN,TX,UT,VA,WA
0,72.0,0,47,1,0,0,0,1,False,False,...,False,False,False,False,False,False,False,False,False,False
1,87.5,0,36,1,0,0,0,0,False,False,...,False,False,False,False,False,False,False,False,False,False
2,85.0,1,10,1,0,1,0,1,False,False,...,False,False,False,False,False,False,False,False,False,False
3,76.5,1,55,1,0,0,0,0,False,False,...,False,False,False,False,False,False,False,False,False,True
4,114.5,1,22,1,0,0,0,1,False,False,...,False,False,False,False,False,False,False,False,False,False

In [11]:
X=final.drop('avg_salary',axis='columns')
y=final['avg_salary']

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test=train_test_split(X,y,test_size=0.2)

from sklearn.linear_model import LinearRegression
lr_clf=LinearRegression()
lr_clf.fit(X_train,y_train)
lr_clf.score(X_test,y_test)

0.20113049418138707

In [12]:
from sklearn.model_selection import ShuffleSplit
from sklearn.model_selection import cross_val_score
cv=ShuffleSplit(n_splits=5,test_size=0.2,random_state=0)
cross_val_score(LinearRegression(),X,y,cv=cv)

array([0.21733255, 0.25343636, 0.3185498 , 0.28612557, 0.31066808])

In [13]:
score=cross_val_score(LinearRegression(),X,y,cv=cv)
np.average(score)

0.27722247246338216

In [86]:
from sklearn.model_selection import GridSearchCV
from sklearn.linear_model import Lasso
from sklearn.tree import DecisionTreeRegressor

In [88]:
def find_best_model_using_gridsearchcv(X,y):
    algos = {
        'linear_regression' : {
            'model': LinearRegression(),
            'params': {
                'fit_intercept': [True, False]
            }
        },
        'lasso': {
            'model': Lasso(),
            'params': {
                'alpha': [1,2],
                'selection': ['random', 'cyclic']
            }
        },
        'decision_tree': {
            'model': DecisionTreeRegressor(),
            'params': {
                'criterion' : ['mse','friedman_mse'],
                'splitter': ['best','random']
            }
        }
    }
    scores = []
    cv = ShuffleSplit(n_splits=5, test_size=0.2, random_state=0)
    for algo_name, config in algos.items():
        gs =  GridSearchCV(config['model'], config['params'], cv=cv, return_train_score=False)
        gs.fit(X,y)
        scores.append({
            'model': algo_name,
            'best_score': gs.best_score_,
            'best_params': gs.best_params_
        })

    return pd.DataFrame(scores,columns=['model','best_score','best_params'])

find_best_model_using_gridsearchcv(X,y)

C:\Users\kimmy\miniforge3\lib\site-packages\sklearn\model_selection\_validation.py:547: FitFailedWarning:
10 fits failed out of a total of 20.
The score on these train-test partitions for these parameters will be set to nan.
If these failures are not expected, you can try to debug them by setting error_score='raise'.

Below are more details about the failures:
--------------------------------------------------------------------------------
10 fits failed with the following error:
Traceback (most recent call last):
  File "C:\Users\kimmy\miniforge3\lib\site-packages\sklearn\model_selection\_validation.py", line 895, in _fit_and_score
    estimator.fit(X_train, y_train, **fit_params)
  File "C:\Users\kimmy\miniforge3\lib\site-packages\sklearn\base.py", line 1467, in wrapper
    estimator._validate_params()
  File "C:\Users\kimmy\miniforge3\lib\site-packages\sklearn\base.py", line 666, in _validate_params
    validate_parameter_constraints(
  File "C:\Users\kimmy\miniforge3\lib\site-packages\sklearn\utils\_param_validation.py", line 95, in validate_parameter_constraints
    raise InvalidParameterError(
sklearn.utils._param_validation.InvalidParameterError: The 'criterion' parameter of DecisionTreeRegressor must be a str among {'squared_error', 'absolute_error', 'friedman_mse', 'poisson'}. Got 'mse' instead.

  warnings.warn(some_fits_failed_message, FitFailedWarning)
C:\Users\kimmy\miniforge3\lib\site-packages\sklearn\model_selection\_search.py:1051: UserWarning: One or more of the test scores are non-finite: [       nan        nan 0.36203874 0.39930452]
  warnings.warn(

,model,best_score,best_params
0,linear_regression,0.277222,{'fit_intercept': True}
1,lasso,0.203047,"{'alpha': 1, 'selection': 'cyclic'}"
2,decision_tree,0.399305,"{'criterion': 'friedman_mse', 'splitter': 'ran..."

In [102]:
model=tree.DecisionTreeRegressor(criterion='friedman_mse', splitter='random')
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.49829510328079973

In [103]:
X.columns

Index(['same_state', 'age', 'python_yn', 'R_yn', 'spark', 'aws', 'excel',
       ' AL', ' AZ', ' CA', ' CO', ' CT', ' DC', ' DE', ' FL', ' GA', ' IA',
       ' ID', ' IL', ' IN', ' KS', ' KY', ' LA', ' MA', ' MD', ' MI', ' MN',
       ' MO', ' NC', ' NE', ' NJ', ' NM', ' NY', ' OH', ' OR', ' PA', ' RI',
       ' SC', ' TN', ' TX', ' UT', ' VA', ' WA'],
      dtype='object')

In [119]:
np.where(X.columns==' AL')[0][0]

7

In [121]:
def predict_salary(same_state,age,python,R,spark,aws,excel,state):    
    loc_index = np.where(X.columns==state)[0][0]

    x = np.zeros(len(X.columns))
    x[0] = same_state
    x[1] = age
    x[2] = python
    x[3] = R
    x[4] = spark
    x[5] = aws
    x[6] = excel
    if loc_index >= 0:
        x[loc_index] = 1

    return model.predict([x])[0]

In [122]:
predict_salary(0,28,1,0,0,1,1,' CA') #returned salary in thoundsand USD

C:\Users\kimmy\miniforge3\lib\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but DecisionTreeRegressor was fitted with feature names
  warnings.warn(

113.5

In [123]:
import pickle
with open('salary_prediction','wb') as f:
    pickle.dump(model,f)

In [124]:
import json
columns = {
    'data_columns' : [col.lower() for col in X.columns]
}
with open("columns.json","w") as f:
    f.write(json.dumps(columns))